app/controllers/samples_controller.rb

  def new
    @sample = Sample.new(Sample::SAMPLE_DEFAULT)
    @conditions = Condition.user_lab(current_user).find(:all)
---
SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1