app/controllers/sessions_controller.rb

  def create
    logout_keeping_session!
    if !params[:lab][:id].blank?
      user = User.authenticate(params[:lab][:id], params[:login], params[:password])
      if user
        # Protects against session fixation attacks, causes request forgery
        # protection if user resubmits an earlier form using back
        # button. Uncomment if you understand the tradeoffs.
        # reset_session
        self.current_user = user
        new_cookie_flag = (params[:remember_me] == "1")
        handle_remember_cookie! new_cookie_flag
        redirect_back_or_default('/')
        flash[:notice] = "Logged in successfully"
      else
        note_failed_signin
        @lab         = Lab.find(params[:lab][:id]) if !params[:lab][:id].blank?
---
SELECT * FROM `labs` ORDER BY lab_name
SELECT * FROM `labs` WHERE (`labs`.`id` = 7)