app/controllers/users_controller.rb

  def new
    @user = User.new
    @labs = Lab.order(:lab_name).all
---
SELECT * FROM `labs` ORDER BY lab_name

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
    if success && @user.errors.empty?
      redirect_back_or_default('/')
      flash[:notice] = "Thanks for signing up!  We're sending you an email with your activation code."
    else
      flash[:error]  = "We couldn't set up that account, sorry.  Please try again, or contact system admin"
      @labs = Lab.order(:lab_name).all
---
INSERT INTO `users` (`salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `activation_code`, `remember_token`, `login`, `reset_code`, `email`) VALUES('8529f18a2ff8668500e6b707ed71605a8627fd2a', '2011-02-14 22:38:10', 'cbfcf080b4db45a1ddf1de0cced2b7595e42e944', NULL, '2011-02-14 22:38:10', '8550eea21ffc860b1590c4ed2922316a6d9b8261', NULL, 'sgrimes', NULL, 'sgrimes@stanford.edu')
SELECT * FROM `labs` ORDER BY lab_name